; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	thermograph1 - mode
	image0 - mode
	Star0 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation1 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star4)
	(supports instrument1 image0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument3 thermograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star4)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
)
(:goal (and
	(pointing satellite3 Planet10)
	(have_image Star5 image0)
	(have_image Star6 thermograph1)
	(have_image Phenomenon7 image0)
	(have_image Star8 thermograph1)
	(have_image Star9 image0)
	(have_image Planet10 image0)
	(have_image Star11 thermograph1)
	(have_image Star12 image0)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 9
2. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 9
3. (turn_to satellite1 star12 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star12)
   goals met: 0 of 9
4. (take_image satellite1 star12 instrument2 image0)
   added: (have_image star12 image0)
   goals met: 1 of 9
5. (turn_to satellite1 star11 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star11)
   goals met: 1 of 9
6. (take_image satellite1 star11 instrument2 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 2 of 9
7. (turn_to satellite1 planet10 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 planet10)
   goals met: 2 of 9
8. (take_image satellite1 planet10 instrument2 image0)
   added: (have_image planet10 image0)
   goals met: 3 of 9
9. (turn_to satellite1 phenomenon7 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 9
10. (take_image satellite1 phenomenon7 instrument2 image0)
   added: (have_image phenomenon7 image0)
   goals met: 4 of 9
11. (turn_to satellite1 star5 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star5)
   goals met: 4 of 9
12. (take_image satellite1 star5 instrument2 image0)
   added: (have_image star5 image0)
   goals met: 5 of 9
13. (turn_to satellite1 star6 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star6)
   goals met: 5 of 9
14. (take_image satellite1 star6 instrument2 thermograph1)
   added: (have_image star6 thermograph1)
   goals met: 6 of 9
15. (turn_to satellite1 star8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star8)
   goals met: 6 of 9
16. (take_image satellite1 star8 instrument2 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 7 of 9
17. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 7 of 9
18. (take_image satellite1 star9 instrument2 image0)
   added: (have_image star9 image0)
   goals met: 8 of 9
19. (turn_to satellite3 planet10 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 planet10)
   goals met: 9 of 9
